[Objects]
;YAGER Begin code change by KF
;removed Epic sound classes
;SoundNodeAttenuation="Attenuation"
;SoundNodeDelay="Delay"
;SoundNodeConcatenator="Concatenator"
;SoundNodeDistanceCrossFade="Distance CrossFade"
;SoundNodeLooping="Looping"
;SoundNodeMature="Sound Node Mature"
;SoundNodeMixer="Mixer"
;SoundNodeModulator="Modulator"
;SoundNodeModulatorContinuous="Continuous Modulator"
;SoundNodeOscillator="Oscillator"
;SoundNodeRandom="Random"
;YAGER End code change by KF
ParticleModuleAccelerationBase="Acceleration"
ParticleModuleAttractorBase="Attraction"
ParticleModuleBeamBase="Beam"
ParticleModuleCameraBase="Camera"
ParticleModuleCameraOffset="Camera Offset"
ParticleModuleCollisionBase="Collision"
ParticleModuleColorBase="Color"
ParticleModuleEventBase="Event"
ParticleModuleKillBase="Kill"
ParticleModuleLifetimeBase="Lifetime"
ParticleModuleLocationBase="Location"
ParticleModuleMaterialBase="Material"
ParticleModuleOrbitBase="Orbit"
ParticleModuleOrientationBase="Orientation"
ParticleModuleParameterBase="Parameter"
ParticleModuleRotationBase="Rotation"
ParticleModuleRotationRateBase="RotationRate"
ParticleModuleSizeBase="Size"
ParticleModuleSpawnBase="Spawn"
ParticleModuleSubUVBase="SubUV"
ParticleModuleTrailBase="Trail"
ParticleModuleUberBase="Uber"
ParticleModuleVelocityBase="Velocity"
ParticleModuleAcceleration="Acceleration"
ParticleModuleAccelerationOverLifetime="Acceleration/Life"
ParticleModuleAttractorParticle="Particle Attractor"
ParticleModuleAttractorPoint="Point Attractor"
ParticleModuleAttractorLine="Line Attractor"
ParticleModuleBeamModifier="Beam Modifier"
ParticleModuleBeamMultiTarget="MultiTarget"
ParticleModuleBeamNoise="Noise"
ParticleModuleBeamSource="Source"
ParticleModuleBeamTarget="Target"
ParticleModuleCollision="Collision"
ParticleModuleColor="Initial Color"
ParticleModuleColorByParameter="Parameter Color"
ParticleModuleColorOverLife="Color Over Life"
ParticleModuleColorScaleOverLife="Scale Color/Life"
ParticleModuleEventGenerator="Event Generator"
ParticleModuleEventReceiverKillParticles="EventRcvr KillAll"
ParticleModuleEventReceiverSpawn="EventRcvr Spawn"
ParticleModuleKillBox="Kill Box"
ParticleModuleKillHeight="Kill Height"
ParticleModuleLifetime="Lifetime"
ParticleModuleLocation="Initial Location"
ParticleModuleLocationActor="Actor"
ParticleModuleLocationDirect="Direct Location"
ParticleModuleLocationEmitter="Emitter InitLoc"
ParticleModuleLocationEmitterDirect="Emitter DirectLoc"
ParticleModuleLocationPrimitiveCylinder="Cylinder"
ParticleModuleLocationPrimitiveSphere="Sphere"
ParticleModuleLocationBoneSocket="Bone/Socket Location"
ParticleModuleMaterialByParameter="Parameter Material"
ParticleModuleMeshMaterial="Mesh Material"
ParticleModuleMeshMaterialByParameter="Parameter Mesh Material"
ParticleModuleMeshRotation="Init Mesh Rotation"
ParticleModuleMeshRotationRate="Init Mesh RotRate"
ParticleModuleMeshRotationRateMultiplyLife="MeshRotRate*Life"
ParticleModuleMeshRotationRateOverLife="MeshRotRateOverLife"
ParticleModuleOrbit="Orbit"
ParticleModuleOrbitOffset="Orbit Offset"
ParticleModuleOrbitRotation="Orbit Rotate"
ParticleModuleOrbitRotationRate="Orbit RotationRate"
ParticleModuleOrientationAxisLock="Lock Axis"
ParticleModuleParameterDynamic="Dynamic"
ParticleModuleParameterInitialColor="Init Color (param)"
ParticleModuleRequired="Required"
ParticleModuleRotation="Initial Rotation"
ParticleModuleRotationOverLifetime="Rotation/Life"
ParticleModuleRotationRate="Initial RotRate"
ParticleModuleRotationRateMultiplyLife="RotRate/Life"
ParticleModuleSize="Initial Size"
ParticleModuleSizeMultiplyLife="Size By Life"
ParticleModuleSizeMultiplyVelocity="Size By Velocity"
ParticleModuleSizeScale="Size Scale"
ParticleModuleSizeScaleByTime="Size Scale By Time"
ParticleModuleSourceMovement="Source Movement"
ParticleModuleSpawn="Spawn"
ParticleModuleSpawnPerUnit="Spawn PerUnit"
ParticleModuleStoreSpawnTimeBase="Store Spawn Time"
ParticleModuleStoreSpawnTime="Store Spawn Time"
ParticleModuleSubUV="SubImage Index"
ParticleModuleSubUVDirect="SubUV Direct"
ParticleModuleSubUVMovie="SubUV Movie"
ParticleModuleSubUVSelect="SubUV Select"
ParticleModuleTrailSource="Source"
ParticleModuleTrailSpawn="Spawn"
ParticleModuleTrailTaper="Taper"
ParticleModuleTypeDataBeam="Beam Data"
ParticleModuleTypeDataBeam2="Beam Data"
ParticleModuleTypeDataFlameThrower="Flame Thrower"
ParticleModuleTypeDataMesh="Mesh Data"
ParticleModuleTypeDataSubUV="SubUV Data"
ParticleModuleTypeDataTrail="OLD Trail Data"
ParticleModuleTypeDataTrail2="Trail Data"
ParticleModuleTypeDataRibbon="Ribbon Data"
ParticleModuleTypeDataAnimTrail="AnimTrail Data"
ParticleModuleTypeDataPhysX="PhysX Sprite Data"
ParticleModuleTypeDataMeshPhysX="PhysX Mesh Data"
ParticleModuleUberLTISIVCL="UberLTISIVCL"
ParticleModuleUberLTISIVCLIL="UberLTISIVCLIL"
ParticleModuleUberLTISIVCLILIRSSBLIRR="UberLTISIVCLILIRSSBLIRR"
ParticleModuleVelocity="Initial Velocity"
ParticleModuleVelocityInheritParent="Inherit Parent Vel."
ParticleModuleVelocityOverLifetime="Velocity/Life"
InterpTrackDirector="Director Track"
InterpTrackEvent="Event Track"
InterpTrackFade="Fade Track"
InterpTrackBoolProp="Bool Property Track"
InterpTrackFloatProp="Float Property Track"
InterpTrackVectorProp="Vector Property Track"
InterpTrackColorProp="Color Property Track"
InterpTrackLinearColorProp="LinearColor Property Track"
InterpTrackMove="Movement Track"
InterpTrackSlomo="Slomo Track"
InterpTrackAnimControl="Anim Control Track"
InterpTrackSound="Sound Track"
InterpTrackFloatParticleParam="Float Particle Param Track"
InterpTrackFloatMaterialParam="Float Material Param Track"
InterpTrackVectorMaterialParam="Vector Material Param Track"
InterpTrackBlurAlpha="Bloom Alpha Track"
InterpTrackColorScale="Color Scale Track"
InterpTrackFaceFX="FaceFX Track"
InterpTrackToggle="Toggle Track"
InterpTrackMorphWeight="Morph Weight"
InterpTrackSkelControlScale="SkelControl Scale Track"
InterpTrackAudioMaster="Audio Master Track"
InterpTrackVisibility="Visibility Track"
InterpTrackParticleReplay="Particle Replay Track"
YParticleModuleColorSet="Module Color Set (Y)"
YParticleModuleRadialVelocity="Radial Velocity (Y)"
YParticleModuleBasicRotation="Basic Rotation (Y)"
YParticleModuleCollisionDecal="Collision Decal (Y)"
YParticleModuleCollisionHurt="Collision Hurt (Y)"
YParticleModuleLocationPosArray="Location PosArray (Y)"
YParticleModuleLocationBeamEnd="LocByBeamEnd (Y)"
YParticleModuleScaleByBeamLength="ScaleByBeam (Y)"
YParticleModuleLocationVertex="Location Vertex (Y)"
YParticleModuleLocationWorldPosArray="Location World PosArray (Y)"
YParticleModuleOrientationAxisLockWorld="Lock World (Y)"
YParticleModuleRadialVelocity="RadialVelocity (Y)"
YParticleModuleAdvSet="Adv Set (Y)"
YParticleModuleBasicSet="Basic Set (Y)"
YParticleModuleYagerBase="Yager Modules"
YParticleModuleTypeDataFast="Fast Data (Y)"
YParticleModuleTypeDataFastMesh="Fast Mesh Data (Y)"

; ProcBuilding Rule Nodes
PBRuleNodeMesh="Mesh"
PBRuleNodeRepeat="Repeat"
PBRuleNodeSplit="Split"
PBRuleNodeQuad="Quad"
PBRuleNodeExtractTopBottom="Top/Bottom"
PBRuleNodeAlternate="Alternate"
PBRuleNodeOcclusion="Occlusion"
PBRuleNodeRandom="Random"
PBRuleNodeEdgeAngle="EdgeAngle"
PBRuleNodeLODQuad="LODQuad"
PBRuleNodeCorner="Corner"
PBRuleNodeSize="Size"
PBRuleNodeEdgeMesh="Edge Mesh"
PBRuleNodeVariation="Variation"
PBRuleNodeComment="Comment"
PBRuleNodeSubRuleset="SubRuleset"
PBRuleNodeWindowWall="WindowWall"
PBRuleNodeTransform="Transform"
PBRuleNodeCycle="Cycle"
UIMessageBox="Generic Message Box"
UIScene="Generic UIScene"
UIButton="Button [[Standard]]"
UICheckbox="Checkbox"
UICalloutButtonPanel="Panel [Button Panel]"
UIComboBox="Combobox"
UIEditBox="Editbox [[Standard]]"
UIImage="Image"
UILabel="Label [[Standard]]"
UILabelButton="Label [Button]"
UIList="List [[Standard]]"
UIMeshWidget="Panel [3D-Mesh Container]"
UINavigationList="List [Navigation]"
UINumericEditBox="Editbox [Numeric]"
UINumericOptionList="List [Cycle Numeric Value]"
UIObjectList="List [Widget Collection]"
UIOptionList="List [Cycle Value]"
UIPanel="Panel [[Standard]]"
UIProgressBar="Progress Bar"
UISafeRegionPanel="Panel [Safe-Region]"
UIScrollFrame="Panel [Scrolling Panel]"
UISlider="Slider"
UITabControl="Tab Control"
UITabPage="Tab Page"
UIToggleButton="Button [Toggle]"
YUITree="Tree"
UIStyle_Text="Text"
UIStyle_Image="Image"
UIStyle_Combo="Combo"
UIState_Enabled="Enabled"
UIState_Disabled="Disabled"
UIState_Focused="Focused"
UIState_Active="Active"
UIState_Pressed="Pressed"
UIState_TargetedTab="Targeted TabButton"
UIComp_AutoAlignment="Generic Alignment"
UIComp_DrawImage="Image Component"
UIComp_DrawString="Text Component"
UIComp_ListElementSorter="Generic Sort Component (Alpha)"
UIComp_ListPresenter="Report View"
UIComp_ListPresenterTree="Tree View (not implemented)"
YUIComp_TreePresenter="Tree Presenter"
